
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Sadan007/aws-ecs-terraform/actions/runs/10417288619)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a0ba3b0f404ad656]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-077e8afac39ee7f81]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07b6e66be004d39ae]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04f8c8e0b309b9665]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0287c59b5885a99c2]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0022df2d039942457]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0861cd90aa56d42b6]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-049daabe7308b8c79]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-044792a6a3d598fb9]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0bd7da502a917f23c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-099d4144a7b649523]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-012128c7e9e3ed103]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00830b3a788daeb9a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07b6e66be004d39ae1080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04c7618844f27ab19]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-004191531bb2bb6ae]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e5900bc2cb1bed80]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0453802d7798cdb1b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f1712a1be07a6e9d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0442f98185814e850]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-06ac392df96d8681d]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0bd7da502a917f23c1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-099d4144a7b6495231080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "controls access to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from all"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-app"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-0a0ba3b0f404ad656"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "allows for ecs"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-0a0ba3b0f404ad656"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from security group for ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-0230e25f5e91bbf6c]
aws_security_group.alb: Creation complete after 4s [id=sg-0d1fc9776dd76127c]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-3755956967]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"ac23e83eee070d95415fa56e7118059f6bc8429f","Vars":{},"WorkflowName":"Terraform"} -->